Repository: KDE/parley
Catalog: po/*/parley.po
Languages: ar

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com

source: Unit
ar: الوحدة

source: Number of entries in this lesson.
ar: عدد المدخلات في هذا الدرس.

source: The vocabulary document contains no entries that can be used for the chosen type of practice.
ar: لا يحتوي مستند المفردات على إدخالات يُمكن استعمالها لنوع التدريب المختار.

source: Start Practice
ar: ابدأ التدريب

source: <p>Your selection of vocabulary for the practice is empty.</p><p>Below you can choose to ignore some of your configuration settings to start a practice anyway.</p>
ar: <p>اختيارك من المفردات للتدريب فارغ.</p><p>أدناه يُمكنك اختيار تجاهل بعض إعدادات اضبط الخاص بك لبدء تدريب على أي حال.</p>

source: Ignore Configuration for:
ar: تجاهل اضبط لـ:

source: Ignore Lessons
ar: تجاهل الدروس

source: Ignore Word Types
ar: تجاهل أنواع الكلمات

source: Ignore Blocked
ar: تجاهل المحظور

source: Ignore Times Answered Incorrectly
ar: تجاهل عدد المرات التي أُجيبت بشكل غير صحيح

source: Ignore Times Practiced
ar: تجاهل عدد مرات التدريب

source: Ignore Minimum/Maximum Grade
ar: تجاهل الدرجة الدنيا/القصوى

source: Number of Affected Words
ar: عدد الكلمات المتأثرة

source: Total number of entries:
ar: إجمالي عدد الإدخالات:

source: Resulting number of words to practice:
ar: عدد الكلمات الناتجة للتدريب:

# display of the name of the vocabulary collection
source: Collection: %1
ar: التّجميعة: %1

source: None
ar: لا شيء

source: You can drag and drop words onto their word type.
ar: بإمكانك سحب الكلمات وإسقاطها على نوعها.

source: Enable the synonym view to edit synonyms.
ar: فعل عرض المترادفات لتعديلها.

source: Enable the antonym view to edit antonyms.
ar: فعل عرض المتضادات لتعديلها.

source: Pronunciation (%1)
ar: التلفظ (%1)

source: Pronunciation
ar: التلفظ

source: Word Type (%1)
ar: نوع الكلمة (%1)

source: Word Type
ar: نوع الكلمة

source: Synonym
ar: ترادف

source: Synonym (%1)
ar: ترادف (%1)

source: Antonym (%1)
ar: متضاد (%1)

source: Antonym
ar: متضاد

source: Example (%1)
ar: مثال (%1)

source: Example
ar: مثال

source: Comment (%1)
ar: التعليق (%1)

source: Comment
ar: التعليق

source: Paraphrase (%1)
ar: إعادة صوغ (%1)

source: Paraphrase
ar: إعادة صوغ

source: Please use Edit -> Languages to set up your document.
ar: الرجاء استخدام تحرير -> لغات لإعداد مستندك.

source: No Languages Defined
ar: لا يوجد لغات محددة

source: Select a unit before adding vocabulary.
ar: اختر وحدة قبل إضافة مفردات.

source: No Unit Selected
ar: لا يوجد وحدة مُختارة

source: %1 word due
ar: %1 كلمة مستحقة

source: Fully learned
ar: مُتعلمة بالكامل

source: Open this vocabulary collection in the editor
ar: افتح مجموعة المفردات هذه في المحرر

source: Practice Anyway
ar: التدريب على أي حال

source: Practice
ar: التدريب

source: Active Collections
ar: المجموعات النشطة

source: Completed Collections
ar: المجموعات المُكتملة

source: Remove
ar: أزل

source: Are you sure you want to remove this collection?
ar: هل أنت متأكد من أنك تريد إزالة هذه المجموعة؟

source: Parley
ar: المفاوض

source: Create a New Collection...
ar: أنشئ مجموعة جديدة...

source: Open an Existing Collection...
ar: افتح مجموعة موجودة...

source: Download New Collections...
ar: نزّل مجموعات جديدة...

source: <h1>Parley</h1>
ar: <h1>المفاوض</h1>

source: Play
ar: شغّل

source: Record
ar: سجّل

source: Download audio file with webservice
ar: نزّل ملف صوتي باستعمال خدمة الويب

source: Download
ar: نزّل

source: Lookup Current
ar: ابحث عن الحالي

source: Follow Table
ar: اتبع الجدول

source: Could not determine word type of adjectives
ar: لا أستطيع تحديد نوع الكلمة للصفات

source: Could not determine word type of adverbs
ar: لا أستطيع تحديد نوع الكلمة للظروف

source: The comparative is used to compare nouns or verbs (faster)
ar: المقارن يُستعمل للمقارنة بين الأسماء أو الأفعال (أسرع)

source: Absolute:
ar: مطلق:

source: Comparative:
ar: مقارن:

source: The superlative (fastest)
ar: التفضيل (الأسرع)

source: Superlative:
ar: تفضيل:

source: Adjective
ar: صفة

source: Adverb
ar: ظرف

source: Conjugation Forms
ar: أشكال التصريف

source: First
ar: الأول

source: Second
ar: الثاني

source: Third Male
ar: مذكر غائب

source: Third Female
ar: مؤنث غائب

source: Third Neutral
ar: ثالث محايد

source: Ne&xt
ar: ال&تالي

source: &Tense:
ar: ا&لصيغة:

source: Singular
ar: إفراد

source: Dual
ar: المثنى

source: Plural
ar: صيغة جموع

source: Masculine
ar: ذكري

source: Feminine
ar: نسوي

source: Neuter
ar: محايد

source: Declension Forms
ar: أشكال التصريف

# one of the seven cases (grammatical)
source: Nominative:
ar: المرفوع:

# one of the seven cases (grammatical)
source: Genitive:
ar: المجرور:

# one of the seven cases (grammatical)
source: Dative:
ar: المفعول لأجله:

# one of the seven cases (grammatical)
source: Accusative:
ar: المفعول به:

# one of the seven cases (grammatical)
source: Ablative:
ar: الحالي:

# one of the seven cases (grammatical)
source: Locative:
ar: الظرفي:

# one of the seven cases (grammatical)
source: Vocative:
ar: النداء:

source: Number:
ar: العدد:

source: Next
ar: التالي

source: Units
ar: الوحدات

source: Right click to add, delete, or rename units. With the checkboxes you can select which units you want to practice. Only checked units [x] will be asked in the practice!
ar: انقر بالزر الأيمن للفأرة لإضافة، حذف، أو إعادة تسمية الوحدات. باستعمال مربعات الاختيار يُمكنك اختيار الوحدات التي تُريد التدريب عليها. الوحدات المحددة فقط [x] هي التي ستُسأل في التدريب!

source: Word Types
ar: أنواع الكلمات

source: Inflection (verbs, adjectives, nouns)
ar: التصريف (أفعال، صفات، أسماء)

source: Comparison Forms
ar: أشكال المقارنة

source: Multiple Choice
ar: اختيار متعدد

source: Synonyms
ar: المرادفات

source: Antonyms
ar: المتضادات

source: False Friends
ar: الأصدقاء الكاذبون

source: Phonetic Symbols
ar: رموز لفظية

source: Image
ar: صورة

source: Summary
ar: الملخّص

source: Sound
ar: الصوت

source: Internet
ar: الشّابكة

source: LaTeX
ar: لاتخ

source: Enter search terms here
ar: ادخل كلمات البحث هنا

source: Search your vocabulary
ar: ابحث في مفرداتك

source: S&earch:
ar: ا&بحث:

source: &File
ar: &ملف

source: &Edit
ar: ت&حرير

source: &View
ar: &عرض

source: &Unit
ar: الو&حدة

source: &Practice
ar: الت&دريب

source: Editor Toolbar
ar: شريط الأدوات المحرر

source: Properties From Original
ar: خصائص من الأصل

source: &Confidence Level:
ar: &مستوى الثقة:

source: &False friend:
ar: &صديق كاذب:

source: Practice &Counts
ar: أ&عداد التدريبات

source: &Wrong:
ar: &خاطئة:

source: Tot&al:
ar: ال&مجموع:

source: &Last Practiced
ar: آخر &تدريب

source: &Never
ar: ال&بتة

source: T&oday
ar: ال&يوم

source: The date this expression was last practiced
ar: تاريخ آخر تدريب لهذا التعبير

source: Not Practiced Yet
ar: لم تمارس بعد

source: &Reset Confidence Levels
ar: إعادة &ضبط مستويات الثقة

source: Verb
ar: فعل

source: Noun
ar: اسم

source: "%1" is a:
ar: ‏"%1" هو:

# @title:window
source: Please select the noun's gender
ar: الرجاء اختيار جنس الاسم

source: Enter LaTeX code here.
ar: أدخل رمز لاتخ LaTeX هنا.

source: LaTeX code:
ar: رمز لاتخ LaTeX:

source: Preview
ar: معاينة

source: Math mode
ar: وضع الرياضيات

source: New Unit
ar: وحدة جديدة

source: Add a new unit to your document
ar: أضف وحدة جديدة إلى مستندك

source: Rename Unit
ar: أعد تسمية الوحدة

source: Delete Unit
ar: احذف الوحدة

source: Delete the selected unit.
ar: احذف الوحدة المُختارة.

source: Split Unit into Smaller Units
ar: قسّم الوحدة إلى وحدات أصغر

source: Make multiple smaller units out of one big unit.
ar: اجعل عدة وحدات أصغر من وحدة كبيرة واحدة.

source: Move to new lesson
ar: انقل إلى درس جديد

source: Moves the selected vocabulary to a new lesson
ar: ينقل المفردات المُختارة إلى درس جديد

source: Remove Confidence Levels
ar: أزل مستوى الثقة

source: Remove confidence levels from this unit.
ar: أزل مستويات الثقة من هذه الوحدة.

source: Remove Confidence Levels From This Unit And All Subunits
ar: أزل مستويات الثقة من هذه الوحدة وجميع الوحدات الفرعية

source: Remove confidence levels from this unit and all subunits.
ar: أزل مستويات الثقة من هذه الوحدة وجميع الوحدات الفرعية.

source: Expand Units and Subunits
ar: وسّع الوحدات والوحدات الفرعية

source: Expand all units and subunits.
ar: وسّع جميع الوحدات والوحدات الفرعية.

source: Collapse All Units And Subunits
ar: اطوِ جميع الوحدات والوحدات الفرعية

source: Collapse all units and subunits.
ar: اطوِ جميع الوحدات والوحدات الفرعية.

source: The root lesson cannot be deleted.
ar: لا يمكن حذف الدرس الجذر.

source: There is %1 word left in this unit. Do you want to delete it?
ar: يوجد كلمة واحدة متبقية في هذه الوحدة. هل تُريد حذفها؟

source: Entries per Unit
ar: المدخلات لكل وحدة

source: The unit will be split into smaller unit. How many entries in each unit do you want?
ar: الوحدة سوف تُقسّم إلى وحدات أصغر. كم عدد الإدخالات التي تُريدها في كل وحدة؟

source: New Lesson
ar: درس جديد

source: Add
ar: أضف

source: Language
ar: اللغة

source: Lesson
ar: درس

source: Word type:
ar: نوع الكلمة:

source: Pronunciation:
ar: النطق:

source: Example:
ar: مثال:

source: Paraphrase:
ar: إعادة صوغ:

source: Comment:
ar: التعليق:

source: Select Synonyms
ar: اختر المرادفات

source: %1 and %2 are not Synonyms
ar: %1 و %2 ليسا مترادفين

source: %1 and %2 are Synonyms
ar: %1 و %2 مترادفين

source: %1 and %2 are not Antonyms
ar: %1 و %2 ليسا متضادين

source: %1 and %2 are Antonyms
ar: %1 و %2 متضادين

source: %1 and %2 are not False Friends
ar: %1 و %2 ليسا أصدقاء كاذبين

source: %1 and %2 are False Friends
ar: %1 و %2 أصدقاء كاذبون

# Title for a list of synonyms for a word
source: Synonyms of %1:
ar: مرادفات %1:

# Title for a list of antonyms (opposites) for a word
source: Antonyms of %1:
ar: متضادات %1:

source: False Friends of %1:
ar: الأصدقاء الكاذبون لـ %1:

# @title:window
source: Vocabulary Columns
ar: أعمدة المفردات

source: Enable/Disable the columns for each language
ar: فعل/عطّل الأعمدة لكل لغة

source: Sound file selected: %1
ar: ملف الصوت المختار: %1

source: Image file selected: %1
ar: ملف الصورة المختار: %1

source: &Add New Entry
ar: أضف &مدخلة جديدة

source: Append a new row to the vocabulary
ar: ألحق صف جديد إلى المفردات

source: &Delete Entry
ar: ا&حذف مدخلة

source: Delete the selected rows
ar: احذف الصفوف المُختارة

source: Copy
ar: انسخ

source: Cut
ar: قصّ

source: Paste
ar: ألصق

source: Select all rows
ar: اختر جميع الصفوف

source: Deselect all rows
ar: ألغِ اختيار جميع الصفوف

source: Vocabulary Columns...
ar: أعمدة المفردات...

source: Toggle display of individual vocabulary columns
ar: بدّل عرض أعمدة المفردات الفردية

source: Do you really want to delete the selected entry?
ar: هل تُريد حقًا حذف الإدخال المختار؟

source: Delete
ar: احذف

source: Nothing to spell check.
ar: لا يوجد شيء للتدقيق الإملائي.

# @title of a popup
source: No Spell Checker Available
ar: لا يوجد مدقق إملائي متاح

# @popupmessage
source: Either the language set up is incorrect or no spellchecker was installed for this locale: %1.
ar: إما أن إعداد اللغة غير صحيح أو لم يُثبت مدقق إملائي لهذه اللغة: %1.

source: New
ar: جديد

source: Add a new word type to your document
ar: أضف نوع كلمة جديد إلى مستندك

source: Rename
ar: غيّر الاسم

source: Rename the selected word type
ar: أعد تسمية نوع الكلمة المختار

source: Delete Word Type
ar: احذف نوع الكلمة

source: Delete the selected word type.
ar: احذف نوع الكلمة المختار.

source: Grammar
ar: قواعد

source: To let Parley know the grammatical meaning of a word type.
ar: للسماح للمفاوض بمعرفة المعنى النحوي لنوع الكلمة.

source: This word type folder contains nouns.
ar: مجلد نوع الكلمة هذا يحتوي على أسماء.

source: Masculine Noun
ar: اسم مذكر

source: This word type folder contains masculine nouns.
ar: مجلد نوع الكلمة هذا يحتوي على أسماء مذكرة.

source: Feminine Noun
ar: اسم مؤنث

source: This word type folder contains feminine nouns.
ar: مجلد نوع الكلمة هذا يحتوي على أسماء مؤنثة.

source: Neuter Noun
ar: اسم محايد

source: This word type folder contains neuter nouns.
ar: مجلد نوع الكلمة هذا يحتوي على أسماء محايدة.

source: This word type folder contains adjectives.
ar: مجلد نوع الكلمة هذا يحتوي على صفات.

source: This word type folder contains adverbs.
ar: مجلد نوع الكلمة هذا يحتوي على ظروف.

source: This word type folder contains verbs.
ar: مجلد نوع الكلمة هذا يحتوي على أفعال.

source: Conjunction
ar: الاقتران

source: This word type folder contains conjunctions.
ar: مجلد نوع الكلمة هذا يحتوي على حروف عطف.

source: No Special Type
ar: لا يوجد نوع خاص

source: This word type folder contains no word type with special meaning.
ar: مجلد نوع الكلمة هذا لا يحتوي على نوع كلمة له معنى خاص.

source: The root word type cannot be deleted.
ar: لا يمكن حذف نوع الكلمة الجذر.

source: There is a word left with this word type. It will lose its type. Continue?
ar: يوجد كلمة متبقية بنوع الكلمة هذا. ستفقد نوعها. أكمل؟

# @title:window
source: Export
ar: صدّر

source: HTML document
ar: مستند HTML

source: Could not write to file "%1"
ar: تعذّرت الكتابة إلى الملف "%1"

source: Export As
ar: صدِّر إلى

source: Untitled
ar: غير معنون

source: Export
ar: صدّر

source: Flash Cards - to print learning cards (HTML)
ar: بطاقات الفلاش - لطباعة بطاقات التعلم (HTML)

source: A vocabulary list that works in a web-browser and can be printed (HTML)
ar: قائمة مفردات تعمل في متصفح ويب و يُمكن طباعتها (HTML)

source: Comma separated values (CSV)
ar: قيم مفصولة بفواصل (CSV)

source: Vocabulary Trainer
ar: مدرب المفردات

source: © 1999-2002 Ewald Arnold © 2001-2002 The KDE team © 2004-2007 Peter Hedlund © 2007-2010 Frederik Gladhorn
ar: © 1999-2002 إيوولد أرنولد © 2001-2002 فريق كيدي © 2004-2007 بيتر هيدلاند © 2007-2010 فريدريك جلادهورن

source: Helps you train your vocabulary
ar: يساعدك على تدريب مفرداتك

source: Inge Wallin
ar: ينغ والين

source: Developer and Co-maintainer
ar: مطور ومشارك في الصيانة

source: Amarvir Singh
ar: أمارفير سينغ

source: Frederik Gladhorn
ar: فريدريك جلادهورن

source: Developer, former maintainer
ar: مطور، صائن سابق

source: Daniel Laidig
ar: دانيال لايدج

source: Developer
ar: المطوّر

source: David Capel
ar: ديفيد كابيل

source: Practice Dialogs
ar: حوارات التدريب

source: Avgoustinos Kadis
ar: أفجوستينوس كاديس

source: Scripting
ar: البرمجة

source: Peter Hedlund
ar: بيتر هيدلوند

source: Countless fixes, former maintainer, port to KDE4
ar: إصلاحات لا تُحصى، صائن سابق، منفذ إلى كيدي ٤

source: Ewald Arnold
ar: إيوولد أرنولد

source: Original Author
ar: المؤلف الأصلي

source: Lee Olson
ar: لي ولسون

source: Artwork and Oxygen Icons
ar: الأعمال الفنية وأيقونات أكسجين

source: Anne-Marie Mahfouf
ar: آن ماري محفوف

source: Port to KConfig XT
ar: المنفذ إلى KConfig XT

source: Jeremy Whiting
ar: جيريمي وايتينغ

source: Rewriting the kvtml library for KDE4
ar: إعادة كتابة مكتبة kvtml لكيدي ٤

source: Markus Büchele
ar: ماركوس بيتشيلي

source: Bug reports and testing on the way to KDE4
ar: تقارير الأخطاء والاختبارات في الطريق إلى كيدي ٤

source: Ramona Knapp
ar: رامونا كناب

source: Conceived the name Parley
ar: ابتكر اسم المفاوض

source: [file]
ar: [ملف]

source: Document file to open
ar: ملف المستند المراد فتحه

source: Creates a new vocabulary collection
ar: يُنشئ مجموعة مفردات جديدة

source: Opens an existing vocabulary collection
ar: يفتح مجموعة مفردات موجودة

source: Open &Downloaded Vocabularies...
ar: افتح المفردات ال&منزلة...

source: Open downloaded vocabulary collections
ar: افتح مجموعات المفردات المنزلة

source: Save the active vocabulary collection
ar: احفظ مجموعة المفردات النشطة

source: Save the active vocabulary collection with a different name
ar: احفظ مجموعة المفردات النشطة باسم مختلف

source: &Export...
ar: &صدّر...

source: Export to HTML or CSV
ar: صدر إلى HTML أو CSV

source: &Properties...
ar: &خصائص...

source: Edit document properties
ar: عدّل خصائص المستند

source: Dashboard
ar: لوحة التحكم

source: Close the current vocabulary collection and show the dashboard
ar: أغلق مجموعة المفردات الحالية واعرض لوحة التحكم

source: Quit Parley
ar: أنهِ المفاوض

source: Show the configuration dialog
ar: اعرض حواري الضبط

source: &Languages...
ar: ا&للغات...

source: Edit which languages are in the collection and their grammar properties.
ar: عدّل اللغات الموجودة في المجموعة وخصائصها النحوية.

source: Remove all confidence levels from the current document
ar: أزل جميع مستويات الثقة من المستند الحالي

source: Show Entries from Child Units
ar: اعرض الإدخالات من الوحدات الفرعية

source: Enable to also see the entries of child units in each unit.
ar: فعلها لرؤية إدخالات الوحدات الفرعية في كل وحدة أيضًا.

source: Automatic Translation
ar: ترجمة آلية

source: Enable automatic translation of the unit entries.
ar: فعل الترجمة الآلية لإدخالات الوحدة.

source: Start Practice...
ar: ابدأ التدريب...

source: Start practicing
ar: ابدأ التدريب

source: Configure Practice...
ar: اضبط التدريب...

source: Change practice settings
ar: غيّر إعدادات التدريب

source: Export Results...
ar: صدّر النتائج...

source: Write a file with the results of the practice
ar: اكتب ملفًا يحتوي على نتائج التدريب

source: Editor
ar: المحرّر

source: Switch to vocabulary editor
ar: انتقل إلى محرر المفردات

source: Show Se&arch
ar: اعرض البحث

source: Toggle display of the search bar
ar: تثبيت عرض شريط البحث

# @title:window document properties
source: Properties for %1
ar: خصائص %1

# @title:window
source: Open Vocabulary Collection
ar: افتح مجموعة المفردات

source: Open in practice &mode
ar: افتح في وضع ال&تدريب

source: The vocabulary collection is locked by another process. You can open the file if you take over the lock, but you will lose any changes from the other process. Do you want to take over the lock?
ar: مجموعة المفردات مقفلة من قبل عملية أخرى. يُمكنك فتح الملف إذا استحوذت على القفل، ولكنك ستخسر أي تغييرات من العملية الأخرى. هل تُريد الاستحواذ على القفل؟

source: Take Over Lock
ar: استحوذ على القفل

source: Opening collection "%1" resulted in an error: %2
ar: فُتحت المجموعة ”%1“ ونتج عنها خطأ: %2

# @title:window
source: Open Collection
ar: افتح المجموعة

source: Vocabulary is modified. Save file before exit?
ar: عدّلت المفردات. احفظ الملف قبل الخروج؟

# @title:window
source: Open Downloaded Vocabulary Collection
ar: افتح مجموعة المفردات المنزلة

source: File "%1" is locked by another process. You can save to the file if you take over the lock, but you will lose any changes from the other process. Do you want to take over the lock?
ar: الملف ”%1“ مُقفل من قبل عملية أخرى. يُمكنك الحفظ في الملف إذا استحوذت على القفل، ولكنك ستخسر أي تغييرات من العملية الأخرى. هل تُريد الاستحواذ على القفل؟

source: Writing file "%1" resulted in an error: %2
ar: كتابة الملف ”%1“ نتج عنها خطأ: %2

# @title:window
source: Save File
ar: احفظ الملفّ

# @title:window
source: Save Vocabulary As
ar: احفظ المفردات باسم

source: <qt>The file<p><b>%1</b></p>already exists. Do you want to overwrite it?</qt>
ar: <qt>الملف<p><b>%1</b></p>موجود. هل تُريد استبداله؟</qt>

# @info:status saving a file
source: Saving %1
ar: يحفظ %1

source: Public Domain
ar: ملكية عامة

source: Languages
ar: اللغات

source: A Second Language
ar: لغة ثانية

source: Lesson 1
ar: درس 1

source: Could not open vocabulary collection "%1"
ar: لا أستطيع فتح مجموعة المفردات ”%1“

source: You cannot start to practice when the known language is the same as the language to learn.
ar: لا يُمكنك بدء التدريب عندما تكون اللغة المعروفة هي نفسها اللغة التي تُريد تعلمها.

source: Select languages
ar: اختر لغات

source: Download New Vocabularies...
ar: حمل معجم جديد ...

source: Downloads new vocabulary collections
ar: ينزّل مجموعات مفردات جديدة

source: Main Toolbar
ar: شريط الأدوات الرئيسي

source: Practice Toolbar
ar: شريط أدوات التدريب

source: Statistics Toolbar
ar: شريط أدوات الإحصاءات

source: Practice Summary Toolbar
ar: شريط أدوات ملخص التدريب

source: Stop
ar: أوقف

source: All comparison forms were right.
ar: جميع أشكال المقارنة صحيحة.

source: "%1" is the wrong word.
ar: ”%1“ كلمة خاطئة.

source: Both comparison forms (comparative and superlative) are wrong.
ar: كلا شكلي المقارنة (المقارن والمفضل) خاطئان.

source: The comparative is wrong.
ar: المقارن خاطئ.

source: The superlative is wrong.
ar: المفضل خاطئ.

source: Enter the comparison forms.
ar: أدخل أشكال المقارنة.

source: Do not Care
ar: لا تهتم

source: 30 Min
ar: 30 دق

source: 1 Hour
ar: ساعة واحدة

source: 2 Hours
ar: ساعتين

source: 4 Hours
ar: 4 ساعات

source: 8 Hours
ar: 8 ساعات

source: 12 Hours
ar: 12 ساعة

source: 18 Hours
ar: 18 ساعة

source: 1 Day
ar: يوم واحد

source: 2 Days
ar: يومين

source: 3 Days
ar: 3 أيام

source: 4 Days
ar: 4 أيام

source: 5 Days
ar: 5 أيام

source: 6 Days
ar: 6 أيام

source: 1 Week
ar: أسبوع واحد

source: 2 Weeks
ar: أسبوعين

source: 3 Weeks
ar: 3 أسابيع

source: 4 Weeks
ar: 4 أسابيع

source: 1 Month
ar: شهر واحِد

source: 2 Months
ar: شهرين

source: 3 Months
ar: 3 أشهر

source: 4 Months
ar: 4 أشهر

source: 5 Months
ar: 5 أشهر

source: 6 Months
ar: 6 أشهر

source: 10 Months
ar: 10 أشهر

source: 12 Months
ar: 12 شهراً

source: Illogical blocking times.
ar: أوقات حجب غير منطقية.

source: The time for level %1 should be lower than the time for level %2.
ar: وقت المستوى %1 يجب أن يكون أقل من وقت المستوى %2.

source: Illogical expiration times.
ar: أوقات انتهاء صلاحية غير منطقية.

source: Illogical blocking vs. expiration times.
ar: أوقات حجب مقابل أوقات انتهاء صلاحية غير منطقية.

source: The blocking time at level %1 should be lower than the expiration time.
ar: وقت الحجب عند المستوى %1 يجب أن يكون أقل من وقت انتهاء الصلاحية.

source: Illogical Values
ar: قيم غير منطقية

source: Level &2:
ar: المستوى &2:

source: Level &5:
ar: المستوى &5:

source: Level &6:
ar: المستوى &6:

source: E&xpiring
ar: انتهاء الصلاحية

source: Bl&ocking
ar: ال&حجب

source: Level &4:
ar: المستوى &4:

source: Level &7:
ar: المستوى &7:

source: Level &1:
ar: المستوى &1:

source: Level &3:
ar: المستوى &3:

source: Do not practice vocabulary that has been asked within:
ar: لا تدرب على المفردات التي سُئلت خلال:

source: Vocabulary drops one grade after this much time:
ar: المفردات تنزل درجة واحدة بعد هذا الوقت:

source: Include Adjectives
ar: ضمن الصفات

source: Include Adverbs
ar: ضمن الظروف

# @title:window
source: Configure Practice
ar: اضبط التدريب

source: General
ar: عامّ

# Configure general settings for practicing vocabulary.
source: General Practice Settings
ar: إعدادات التدريب العامة

# @title:group vocabulary can be set to be blocked for a certain amount of time
source: Blocking
ar: حجب

source: Blocking Settings
ar: إعدادات الحجب

# @title:group ignore vocabulary based on some properties like word type
source: Thresholds
ar: عتبات

source: Threshold Settings
ar: إعدادات العتبة

source: Specific
ar: محدد

# Configure specific settings for practicing vocabulary.
source: Specific Practice Settings
ar: إعدادات تدريب محددة

source: Correction
ar: تصحيح

source: Answers with wrong accents are still counted as correct.
ar: الإجابات التي بها أخطاء في الحركات تُحتسب صحيحة.

source: Ignore accents
ar: تجاهل الحركات

source: Any captitalization in the answer is counted as correct.
ar: أي حرف كبير في الإجابة يُحتسب صحيحًا.

source: Ignore capitalization
ar: تجاهل الحرف الكبير

source: Any punctuation mistake in the answer is counted as correct.
ar: أي خطأ في علامات الترقيم في الإجابة يُحتسب صحيحًا.

source: Ignore punctuation
ar: تجاهل علامات الترقيم

source: During the practice you can use the hint button to see parts of the solution.
ar: خلال التدريب، يُمكنك استخدام زر التلميح لرؤية أجزاء من الحل.

source: Enable hints
ar: فعل التلميحات

source: Images and Sound
ar: الصور والصوت

source: During the practice, images are shown for the question.
ar: خلال التدريب، تُعرض صور للسؤال.

source: Image for question
ar: صورة للسؤال

source: During the practice, images are shown for the solution.
ar: خلال التدريب، تُعرض صور للحل.

source: Image for solution
ar: صورة للحل

source: Allow using images instead of words in flashcards.
ar: اسمح باستخدام الصور بدلًا من الكلمات في بطاقات الفلاش.

source: Allow images instead of words
ar: اسمح بالصور بدلًا من الكلمات
