Repository: KDE/parley
Catalog: po/*/parley.po
Languages: ar

source: Enable playing of pronunciation sound files during the practice.
ar: فعل تشغيل ملفات صوت النطق خلال التدريب.

source: By default you are asked to enter synonyms until you enter the one that is associated directly with the current word. With this option enabled any synonym is accepted.
ar: بشكل مبدئي، يطلب منك إدخال مرادفات حتى تدخل المرادف الذي يرتبط مباشرة بالكلمة الحالية. عند تفعيل هذا الخيار، يقبل أي مرادف.

source: Accept any synonym
ar: اقبل أي مرادف

source: Sessions
ar: الجلسات

source: Max session size:
ar: أقصى حجم للجلسة:

source: Max number of new words:
ar: أقصى عدد من الكلمات الجديدة:

source: When creating multiple choice practices, try to show answers of the same word type.
ar: عند إنشاء تدريبات الاختيار من متعدد، حاول إظهار إجابات من نفس نوع الكلمة.

source: Use choices of the same word type
ar: استخدم خيارات من نفس نوع الكلمة

source: Number of choices:
ar: عدد الخيارات:

source: Only practice vocabulary that fulfills the following conditions:
ar: فقط تدرب على المفردات التي تستوفي الشروط التالية:

source: At least
ar: على الأقل

source: At most
ar: على الأكثر

source: Grade:
ar: الدرجة:

source: Times practiced:
ar: عدد مرات التدريب:

source: Answered incorrectly:
ar: أجيبت بشكل غير صحيح:

source: All conjugation forms were right.
ar: كانت جميع أشكال التصريف صحيحة.

# You did not get the conjugation forms right.
source: You answered %1 conjugation form correctly.
ar: أجبت على %1 شكل تصريف بشكل صحيح.

source: Enter all conjugation forms.
ar: أدخل جميع أشكال التصريف.

source: Choose the right article for "%1"
ar: اختر الأداة الصحيحة للكلمة "%1"

# @label the gender of the word: masculine
source: %1 is masculine
ar: الكلمة %1 مذكّرة

# @label the gender of the word: feminine
source: %1 is feminine
ar: الكلمة %1 مؤنثة

# @label the gender of the word: neuter
source: %1 is neuter
ar: الكلمة %1 محايدة

# Display of the current unit during practice
source: Unit: %1
ar: الوحدة: %1

source: New word
ar: كلمة جديدة

source: %1, confidence %2
ar: %1، ثقة %2

source: initial
ar: مبدئي

source: long term
ar: بعيد المدى

source: You answered correctly %2 of a total of %1 word. You are %3% done.
ar: أجبت على %2 كلمة بشكل صحيح من أصل %1 كلمة. أنت %3٪ جاهز.

source: Rendering...
ar: يصيّر...

source: LaTeX error.
ar: خطأ في لاتخ LaTeX.

source: You revealed the answer by using too many hints.
ar: كشفت عن الإجابة باستخدام الكثير من التلميحات.

source: Skip this word for now and ask again later
ar: تجاوز هذه الكلمة حاليًا واطلبها مجددًا لاحقًا

source: Answer Later
ar: أجب لاحقًا

source: Hint
ar: تلميح

source: Continue
ar: تابع

source: I Did not Know it
ar: لم أكن أعرفها

source: I Knew it
ar: كنت أعرفها

source: absolute
ar: مطلق

source: comparative
ar: صيغة المقارنة

source: superlative
ar: صيغة التفضيل

source: Stop Practice
ar: أوقف التدريب

source: Stop practicing
ar: أوقف التدريب

source: Change answer to right/wrong
ar: غير الإجابة إلى صحيح/خطأ

source: When you answered, Parley will display that the answer was right or wrong. This shortcut changes how the answer is counted.
ar: عندما تجيب، المفاوض سيُظهر أن الإجابة كانت صحيحة أو خاطئة. هذا الاختصار يغير كيف تحتسب الإجابة.

# number of words, minutes, seconds
source: You practiced %1 in %2 and %3.
ar: تدربت على %1 في %2 و %3.

source: one word
ar: كلمة واحدة

source: one minute
ar: أقل من دقيقة

source: one second
ar: ثانية واحدة

source: Practice Overview
ar: نظرة عامة على التدريب

source: Switch to the Practice Overview page
ar: انتقل إلى صفحة نظرة عامة على التدريب

source: HTML Files
ar: ملفات HTML

source: OpenDocument text files
ar: ملفات OpenDocument النصية

source: Practice results
ar: نتائج التدريب

source: Answered questions: %1
ar: الأسئلة التي أجيب عليها: %1

source: Correct answers: %1
ar: الإجابات الصحيحة: %1

source: Wrong answers: %1
ar: الإجابات الخاطئة: %1

source: <b>Attempts</b>
ar: <b>المحاولات</b>

source: <b>Question</b>
ar: <b>سؤال</b>

source: <b>Correct answer</b>
ar: <b>إجابة صحيحة</b>

source: <b>Your errors</b>
ar: <b>أخطاؤك</b>

source: Could not write to %1
ar: لم استطع الكتابة إلى %1

source: Could not write file
ar: فشل كتابة الملف

source: Attempts
ar: المحاولات

source: Question
ar: سؤال

source: Solution
ar: محلول

source: Your Answer
ar: إجابتك

source: The vocabulary collection contains fewer than two languages.
ar: تحتوي مجموعة المفردات على أقل من لغتين.

source: Could not start practice
ar: فشل بدء التدريب

source: This answer will be counted as correct. Words will only be counted as correct if they are answered correctly on the first attempt.
ar: سوف تحسب هذه الإجابة على أنها صحيحة. الكلمات تحسب صحيحة فقط إذا أجيب عليها بشكل صحيح في المحاولة الأولى.

source: Count this answer as wrong
ar: احسب هذه الإجابة على أنها خاطئة

source: This answer will be counted as wrong. Words will only be counted as correct if they are answered correctly on the first attempt.
ar: سوف تحسب هذه الإجابة على أنها خاطئة. الكلمات تحسب صحيحة فقط إذا أجيب عليها بشكل صحيح في المحاولة الأولى.

source: Count this answer as correct
ar: احسب هذه الإجابة على أنها صحيحة

# test results
source: %1 % correct
ar: %1 ٪ صحيح

# test results
source: %1 % wrong
ar: %1 ٪ خطأ

# test results
source: %1 % not answered
ar: %1 ٪ لم يُجَب عليها

source: Answered correctly on the first attempt: %1 of %2 (%3 %)
ar: أجيب بشكل صحيح في المحاولة الأولى: %1 من %2 (%3 %)

source: Answered wrong on the first attempt: %1 of %2 (%3 %)
ar: أجيب بشكل خاطئ في المحاولة الأولى: %1 من %2 (%3 %)

source: Not answered during this practice: %1 of %2 (%3 %)
ar: لم يُجَب عليها خلال هذا التدريب: %1 من %2 (%3 %)

source: Your answer was wrong.
ar: إجابتك كانت خاطئة.

source: Your answer was a synonym. Please enter another word with the same translation.
ar: كانت إجابتك مرادفًا. من فضلك أدخل كلمة أخرى بنفس الترجمة.

source: Your answer was an already entered synonym.
ar: كانت إجابتك مرادفًا مدخلًا بالفعل.

source: Your answer was a synonym and your punctuation was wrong.
ar: كانت إجابتك مرادفًا وعلامة ترقيمك كانت خاطئة.

source: Your answer was a synonym and your capitalization was wrong.
ar: كانت إجابتك مرادفًا والأحرف الكبيرة كانت خاطئة.

source: Your answer was a synonym and accents were wrong.
ar: كانت إجابتك مرادفًا واللّهجات كانت خاطئة.

source: Your answer was a synonym.
ar: كانت إجابتك مرادفًا.

source: Your answer was wrong as punctuation mistakes are not accepted. Please try again.
ar: إجابتك كانت خاطئة لأن أخطاء علامات الترقيم غير مقبولة. من فضلك حاول مرة أخرى.

source: Your answer was wrong as capitalization mistakes are not accepted. Please try again.
ar: إجابتك كانت خاطئة لأن أخطاء الأحرف الكبيرة غير مقبولة. من فضلك حاول مرة أخرى.

source: Your answer was wrong as accent mistakes are not accepted. Please try again.
ar: إجابتك كانت خاطئة لأن أخطاء اللَّهَجات غير مقبولة. من فضلك حاول مرة أخرى.

source: Your answer was wrong. Please try again.
ar: إجابتك كانت خاطئة. من فضلك حاول مرة أخرى.

source: Your answer was right, but your punctuation was wrong.
ar: إجابتك كانت صحيحة، لكن علامة ترقيمك كانت خاطئة.

source: Your answer was right, but your capitalization was wrong.
ar: إجابتك كانت صحيحة، لكن الأحرف الكبيرة كانت خاطئة.

source: Your answer was right, but accents were wrong.
ar: إجابتك كانت صحيحة، لكن اللَّهَجات كانت خاطئة.

source: Your answer was right.
ar: إجابتك كانت صحيحة.

source: Your answer was right... but not on the first try and your punctuation was wrong.
ar: إجابتك كانت صحيحة... لكن ليس في المحاولة الأولى وعلامة ترقيمك كانت خاطئة.

source: Your answer was right... but not on the first try and your capitalization was wrong.
ar: إجابتك كانت صحيحة... لكن ليس في المحاولة الأولى والأحرف الكبيرة كانت خاطئة.

source: Your answer was right... but not on the first try and accents were wrong.
ar: إجابتك كانت صحيحة... لكن ليس في المحاولة الأولى واللَّهَجات كانت خاطئة.

source: Your answer was right... but not on the first try.
ar: إجابتك كانت صحيحة... لكن ليس في المحاولة الأولى.

source: The solution starts with: %1
ar: الحل يبدأ بـ: %1

source: Synonym:
ar: مرادف:

source: General Document Properties
ar: خصائص المستند العامة

source: &Title:
ar: ال&عنوان:

source: A title for your document.
ar: عنوان لمستندك.

source: &Author:
ar: المؤلّ&ف:

source: E&mail:
ar: البريد الإل&كترونيّ:

source: A way to contact you (email or a webpage).
ar: طريقة للاتصال بك (بريد إلكتروني أو صفحة ويب).

source: &Comment:
ar: ال&تعليق:

source: Any additional information.
ar: أي معلومات إضافية.

source: Cate&gory:
ar: ال&فئة:

source: A general category into which your document belongs.
ar: تصنيف عام ينتمي إليه مستندك.

source: Music
ar: الموسيقى

source: Geography
ar: الجغرافيا

source: Anatomy
ar: تشريح

source: History
ar: التاريخ

source: Test Preparation
ar: التحضير للاختبار

source: &License:
ar: الرّ&خصة:

source: The license under which your document will be. If you consider contributing your file to KDE in the future, an appropriate license is required.
ar: الترخيص الذي يخضع له مستندك. إذا فكرت في المساهمة بملفك في مجتمع كيدي في المستقبل، فإن ترخيصًا مناسبًا مطلوب.

source: GPLv2+ (GNU General Public License version 2 or later)
ar: GPLv2+ (رخصة جنو العمومية الإصدار 2 أو الأحدث)

source: &First language:
ar: &اللغة الأولى:

source: &Second language:
ar: اللغة ال&ثانية:

source: &Setup grammar details
ar: &اضبط تفاصيل القواعد

# Attept to download grammar properties for the selected languages
source: Download grammar
ar: نزّل القواعد

source: Selected tenses for conjugation practice.
ar: الأزمنة المختارة لتدريب التصريف.

source: Visible columns in the main editor window.
ar: الأعمدة المرئية في نافذة المحرر الرئيسية.

source: Collapsed tree view items of statistics view window.
ar: عناصر عرض الشجرة المُنطوية في نافذة عرض الإحصائيات.

source: Open/Save
ar: الفتح/الحفظ

source: Always open the collection that was active when quitting Parley
ar: افتح دائمًا المجموعة التي كانت نشطة عند إغلاق المفاوض

source: When this option is checked, the last active collection will be loaded automatically when starting Parley instead of showing the welcome screen.
ar: عند تحديد هذا الخيار، سيتم تحميل آخر مجموعة نشطة بشكل آلي عند بدء المفاوض بدلًا من إظهار شاشة الترحيب.

source: Always load the last opened collection on start
ar: احمل دائمًا آخر مجموعة مفتوحة عند البدء

source: Allow automatic saving of your work
ar: اسمح بالحفظ الآلي لعملك

source: Your work will be automatically saved if you check this option
ar: سوف يحفظ عملك آليًا إذا حددت هذا الخيار

source: &Save vocabularies automatically on close and quit
ar: ا&حفظ المفردات آليًا عند الإغلاق والإنهاء

source: &Create a backup every
ar: أنشئ &نسخة احتياطية كل

source: minutes
ar: دقيقة

source: Sep&arator for text file import/export (CSV):
ar: فاصل لاستيراد/تصدير الملفات النصية (CSV):

source: Choose which separator you want to use to separate your data when importing and exporting text.
ar: اختر الفاصل الذي تريد استخدامه لفصل بياناتك عند استيراد وتصدير النص.

source: Choose the separator to use to divide the parts of an expression when importing or exporting data as text.
ar: اختر الفاصل الذي تريد استخدامه لتقسيم أجزاء التعبير عند استيراد أو تصدير البيانات كنص.

source: Editing
ar: التّحرير

source: &Append new rows automatically when editing
ar: أضف &صفوفًا جديدة آليًا عند التحرير

source: &Get New Themes...
ar: ا&حصل على سمات جديدة...

source: Theme Details
ar: تفاصيل السمة

source: Contact:
ar: الاتصال:

source: Description:
ar: الوصف:

source: Author:
ar: المؤلّف:

# @title:window
source: Edit Languages
ar: حرر اللغات

source: Add language
ar: أضف لغةً

source: Remove language
ar: أزل اللغة

source: New Language
ar: اللغة جديدة

# Edit language properties
source: Properties for %1
ar: خصائص %1

source: Really delete language: %1?
ar: هل تريد حذف اللغة حقًا: %1؟

source: Remove Language
ar: أزل اللغة

source: No KDE keyboard selector found.
ar: لم يعثر على محدد لوحة مفاتيح كيدي.

source: Tense Name
ar: اسم الزمن

source: Enter name of tense:
ar: أدخل اسم الزمن:

source: The selected user defined tense could not be deleted because it is in use.
ar: لا يمكن حذف الزمن المعرّف من قبل المستخدم لأنه قيد الاستخدام.

source: Deleting Tense Description
ar: حذف وصف الزمن

source: General
ar: عامّ

source: Name:
ar: الاسم:

source: Keyboard layout:
ar: تخطيط لوحة المفاتيح:

source: &Download grammar
ar: &نزّل القواعد

source: Spell checker:
ar: المدقق الإملائي:

source: Language:
ar: اللغة:

source: Font (practice):
ar: الخط (تدريب):

source: Font (editor):
ar: الخط (محرر):

source: Articles
ar: المقالات

source: Definite
ar: مؤكّد

source: Indefinite
ar: غير محدد

source: &Male:
ar: &مذكر:

source: &Female:
ar: مؤ&نث:

source: &Neutral:
ar: م&حايد:

source: Personal Pronouns
ar: الضمائر الشخصية

source: &1. Person:
ar: الشخص الأ&ول:

source: &2. Person:
ar: الشخص ال&ثاني:

source: 3. Person:
ar: الشخص الثالث:

source: M&ale:
ar: م&ذكر:

source: F&emale:
ar: م&ؤنث:

source: Neu&ter:
ar: م&حايد:

source: Dual conjugations
ar: تصريفات المثنى

source: A neutral conjugation form exists
ar: توجد صيغة تصريف محايدة

source: Male/female have different conjugations
ar: المذكر/المؤنث لديهم تصريفات مختلفة

source: Tenses
ar: الأزمنة

source: &New...
ar: &جديد...

source: &Modify...
ar: &عدّل...

source: &Delete
ar: ا&حذف

source: Keyboard layout for this locale
ar: تخطيط لوحة المفاتيح لهذا الموضع

source: Spell checker for this language
ar: مدقق إملائي لهذه اللغة

source: The font used during practice
ar: الخط المستخدم أثناء التدريب

source: The font used in the editor
ar: الخط المستخدم في المحرر

source: &Clean Up
ar: &نظّف

source: Theme to use for practice and welcome screen
ar: السمة التي ستستخدم للتدريب وشاشة الترحيب

source: Number of stored setting profiles
ar: عدد تشكيلات الإعدادات المخزنة

source: If true, when using the entry dialog, new rows will be appended as needed
ar: إذا كانت صحيحة، عند استخدام حوار الإدخال، ستضاف صفوف جديدة حسب الحاجة

source: This sets the separator used when copying/pasting text, default is Tab
ar: هذا يحدد الفاصل المستخدم عند نسخ/لصق النص، الفاصل المبدئي هو Tab

source: The number of entries per unit
ar: عدد الإدخالات لكل وحدة

source: If true, on each application start the last opened file will be loaded
ar: إذا كانت صحيحة، عند بدء كل تطبيق، سيتم تحميل آخر ملف مفتوح

source: If true, vocabularies are automatically saved on close and exit
ar: إذا كانت صحيحة، فالمفردات تحفظ آليًا عند الإغلاق والخروج

source: If true, a backup is saved every BackupTime minutes
ar: إذا كانت صحيحة، يحفظ ملف احتياطي كل مدة زمنية بالدقائق

source: Time interval between two automatic backups
ar: الفاصل الزمني بين نسختين احتياطيتين آليتين

source: Show images on the front of the flashcard.
ar: اعرض الصور على وجه البطاقة التعليمية.

source: Show images on the back of the flashcard.
ar: اعرض الصور على ظهر البطاقة التعليمية.

source: In Blocking Query Tab Dialog, if checked then the Query is blocked
ar: في حوار علامة تبويب الاستعلام المحظور، إذا حددت فإن الاستعلام محظور

source: In Blocking Query Tab Dialog, if checked then the Query accepts an expiring time
ar: في حوار علامة تبويب الاستعلام المحظور، إذا حددت فإن الاستعلام يقبل وقت انتهاء صلاحية

source: Append new vocabulary in a collection in order of their units. Note that this will not be a hard transition, but a slow mix from one unit to the next.
ar: أضف مفردات جديدة إلى مجموعة بالترتيب حسب وحداتها. لاحظ أن هذا لن يكون انتقالًا صعبًا، بل مزيجًا بطيئًا من وحدة إلى أخرى.

source: The number of entries that are practiced at the same time. If one of these is answered correctly another entry will be appended.
ar: عدد الإدخالات التي يتدرب عليها في نفس الوقت. إذا أجيب على أحد هذه الإدخالات بشكل صحيح فسيضاف إدخال آخر.

source: Swap direction randomly
ar: ابدل الاتجاه عشوائيًا

source: Limit the time for the user to answer in a test.
ar: حدد الوقت المسموح به للمستخدم للإجابة في اختبار.

source: Show - show the solution after the given time; Continue - go to the next question after the given time.
ar: عرض - اعرض الحل بعد الوقت المحدد؛ استمر - انتقل إلى السؤال التالي بعد الوقت المحدد.

source: Maximum time allowed to answer.
ar: أقصى وقت مسموح للإجابة.

source: Enable suggestion lists in written practice.
ar: مكّن قوائم الاقتراحات في التدريب الكتابي.

source: Enable the showing of hints.
ar: مكّن إظهار التلميحات.

source: Count answers as right when only the accentuation is wrong.
ar: احسب الإجابات على أنها صحيحة عندما تكون اللَّهَجات فقط خاطئة.

source: Count answers as right when only the capitalization is wrong.
ar: احسب الإجابات على أنها صحيحة عندما تكون الأحرف الكبيرة فقط خاطئة.

source: Count answers as right when only the punctuation is wrong.
ar: احسب الإجابات على أنها صحيحة عندما تكون علامات الترقيم فقط خاطئة.

source: Split translations in written practice.
ar: اقسم الترجمات في التدريب الكتابي.

source: Split translations at periods.
ar: اقسم الترجمات عند النقاط.

source: Split translations at colons.
ar: اقسم الترجمات عند النقطتين الرأسيتين.

source: Split translations at semicolons.
ar: اقسم الترجمات عند الفواصل المنقوطة.

source: Split translations at commas.
ar: اقسم الترجمات عند الفواصل.

source: Enable Show More button to reveal parts of the solution in written practice.
ar: مكّن زر اعرض المزيد للكشف عن أجزاء من الحل في التدريب الكتابي.

source: Enable Skip (I Know It) button in written practice.
ar: مكّن زر تخطي (أنا أعرفها) في التدريب الكتابي.

source: When the synonym instead of the word was entered, does it count as correct?
ar: عندما أدخل المرادف بدلًا من الكلمة، هل يحسب صحيحًا؟

source: Enable image display in the practice dialogs.
ar: مكّن عرض الصور في حوارات التدريب.

source: Enable sound playback in the practice dialogs.
ar: مكّن تشغيل الصوت في حوارات التدريب.

source: Allow using images instead of words in flashcards. This will only be done if there is no word in the entry.
ar: اسمح باستخدام الصور بدلًا من الكلمات في البطاقات التعليمية. هذا يحدث فقط إذا لم توجد كلمة في الإدخال.

source: The maximum number of words that will be practiced in a training session.
ar: الحد الأقصى لعدد الكلمات التي يتدرب عليها في جلسة تدريب.

source: The maximum number of new (untrained) words that will be used in a training session.
ar: الحد الأقصى لعدد الكلمات الجديدة (غير المدربة) التي ستستخدم في جلسة تدريب.

source: Limit the number of words in the initial phase.
ar: حدد عدد الكلمات في المرحلة المبدئية.

source: The maximum number of words in the initial phase. If this limit is exceeded, no new words will be introduced.
ar: الحد الأقصى لعدد الكلمات في المرحلة المبدئية. إذا تعدى هذا الحد، فلن تضاف أي كلمات جديدة.

source: Use the same word type as the solution for the incorrect answers in a multiple choice practice.
ar: استخدم نفس نوع الكلمة مثل الحل للإجابات غير الصحيحة في تدريب الاختيار من متعدد.

source: How many answers are provided for a multiple choice question, including the correct answer.
ar: كم عدد الإجابات الموفرة لسؤال الاختيار من متعدد، بما فيها الإجابة الصحيحة.

source: Toggle display of the search bar.
ar: تثبيت عرض شريط البحث

source: When enabled a unit also shows entries from its subunits.
ar: عند التمكين، الوحدة تعرض أيضًا إدخالات من وحداتها الفرعية.

source: Show/hide the unit column.
ar: أظهر/أخفِ عمود الوحدة.

source: Show/hide the active column.
ar: أظهر/أخفِ العمود النشط.

source: Select which units are displayed for editing
ar: اختر الوحدات التي ستعرض للتحرير

source: How the main window is divided.
ar: كيف تقسم النافذة الرئيسة

source: The font used in the vocabulary table
ar: الخط المستخدم في جدول المفردات

source: The font used for phonetics
ar: الخط المستخدم للرموز الصوتية

source: Currently selected column
ar: العمود المحدد حاليًا

source: Currently selected row
ar: الصف المحدد حاليًا

source: Color used to display the confidence levels
ar: اللون المستخدم لعرض مستويات الثقة

source: Color used to display the early confidence levels
ar: اللون المستخدم لعرض مستويات الثقة المبكرة

source: Color used to display invalid units
ar: اللون المستخدم لعرض الوحدات غير الصالحة

source: The entry must have been asked at least this often to be included in the practice.
ar: يجب أن يكون الإدخال قد سئل على الأقل هذا العدد من المرات لكي يدرج في التدريب.

source: The entry must have been asked at most this often to be included in the practice.
ar: يجب أن يكون الإدخال قد سئل على الأكثر هذا العدد من المرات لكي يدرج في التدريب.

source: The entry must have been answered incorrectly at least this often to be included in the practice.
ar: يجب أن يكون الإدخال قد أجيب بشكل غير صحيح على الأقل هذا العدد من المرات لكي يدرج في التدريب.

source: The entry must have been answered incorrectly at most this often to be included in the practice.
ar: يجب أن يكون الإدخال قد أجيب بشكل غير صحيح على الأكثر هذا العدد من المرات لكي يدرج في التدريب.

source: The entry must have at least this confidence level to be included in the practice (0..7).
ar: يجب أن يكون للإدخال على الأقل هذا المستوى من الثقة لكي يدرج في التدريب (0..7).

source: The entry must have at most this confidence level to be included in the practice (0..7).
ar: يجب أن يكون للإدخال على الأكثر هذا المستوى من الثقة لكي يدرج في التدريب (0..7).

source: Only selected word types will be included in practice.
ar: فقط أنواع الكلمات المختارة ستدرج في التدريب.

source: Selected word types for practices.
ar: أنواع الكلمات المختارة للتدريبات.

source: Selected sub word types for practices.
ar: أنواع الكلمات الفرعية المختارة للتدريبات.

source: The language that you are learning.
ar: اللغة التي تتعلمها.

source: The language that you know already.
ar: اللغة التي تعرفها بالفعل.

source: Show the solution after an answer was given.
ar: اعرض الحل بعد إعطاء إجابة.

source: The time the solution is shown (seconds). 0 is unlimited.
ar: الوقت الذي يعرض فيه الحل (بالثواني). 0 هو غير محدود.

source: The practice method that is currently selected.
ar: طريقة التدريب المحددة حاليًا.

source: The practice mode that is currently selected.
ar: وضع التدريب المختار حاليًا.

source: Amount of time different confidence levels should be blocked
ar: مقدار الوقت الذي يجب أن تحجب فيه مستويات الثقة المختلفة

source: Amount of time after which different confidence levels should expire
ar: مقدار الوقت الذي يجب أن تنتهي صلاحية مستويات الثقة المختلفة بعده

source: If true, the practice direction for each practice mode is stored.
ar: إذا كانت صحيحة، فسيتم تخزين اتجاه التدريب لكل وضع تدريب.

source: Should the practice direction for each practice mode be stored?
ar: هل يجب تخزين اتجاه التدريب لكل وضع تدريب؟

source: Stored values of practice direction for each practice mode.
ar: القيم المخزنة لاتجاه التدريب لكل وضع تدريب.

source: The Providers path for Parley
ar: مسار الموفرين للمفاوض

source: The command used to start a downloaded vocabulary
ar: الأمر المستخدم لبدء تنزيل المفردات

source: The folder where downloaded vocabularies are saved by default
ar: المجلد حيث تحفظ المفردات التي نزلت بشكل مبدئي

source: Theme
ar: السمة

# title:window general settings
source: General
ar: عامّ

source: General Settings
ar: الإعدادات العامة

source: View
ar: العرض

source: View Settings
ar: إعدادات المنظور

source: Online Translations
ar: الترجمات عبر الإنترنت

source: Online Translation Services
ar: خدمات الترجمة عبر الإنترنت

source: translate-shell is available.
ar: translate-shell متوفر.

source: translate-shell executable could not be found.
ar: لم يعثر على ملف تشغيل translate-shell.

source: Error
ar: خطأ

source: Translation Shell Integration
ar: تكامل Translation Shell

source: Run Interactive Functionality Test
ar: شغّل اختبار وظائف تفاعلي

source: The interaction test request translation of English word "parley" into German.
ar: اختبار التفاعل يطلب ترجمة كلمة "parley" الإنجليزية إلى الألمانية.

source: Start online test
ar: ابدأ الاختبار عبر الإنترنت

source: Result:
ar: النتيجة:

source: Specify which font to use for displaying pronunciations using phonetic symbols.
ar: حدد الخط الذي ستستخدمه لعرض النطق باستخدام الرموز الصوتية.

source: &Pronunciation symbols font:
ar: &خط الرموز الصوتية:

source: Base color for displaying grades:
ar: اللون الأساسي لعرض الدرجات:

source: Color used to display the progress
ar: اللون المستخدم لعرض التقدم
