Repository: KDE/parley
Catalog: po/*/parley.po
Languages: ar

source: Click here to change the color used to display the progress.
ar: انقر هنا لتغيير اللون المستخدم لعرض التقدم.

source: &Base
ar: الأ&ساس

source: Color for displaying early progress:
ar: اللون لعرض التقدم المبكر:

source: Color used to display the early progress
ar: اللون المستخدم لعرض التقدم المبكر

source: Click here to change the color used to display the early progress.
ar: انقر هنا لتغيير اللون المستخدم لعرض التقدم المبكر.

source: Color used to display the grades:
ar: اللون المستخدم لعرض الدرجات:

source: Click here to change the color used to display invalid units.
ar: انقر هنا لتغيير اللون المستخدم لعرض الوحدات غير الصالحة.

source: Remove confidence levels from this unit
ar: أزل مستويات الثقة من هذه الوحدة

source: Remove confidence levels from this unit and all sub-units
ar: أزل مستويات الثقة من هذه الوحدة وجميع الوحدات الفرعية

source: Remove confidence level from this unit and all sub-units
ar: أزل مستوى الثقة من هذه الوحدة وجميع الوحدات الفرعية

source: Progress gradients
ar: تدرجات التقدم

source: Early progress
ar: التقدم المبكر

source: Not Practiced
ar: لم يتدرب عليه

source: Invalid Entries
ar: إدخالات غير صالحة

# adjective, The word has been properly and fully learned by the user
source: Fully learned
ar: متعلم بالكامل

# adjective, The word has not even been practiced once by the user
source: Not practiced
ar: لم يتدرب عليه

source: Known to Learning
ar: من المعروف إلى التعلم

source: Learning to Known
ar: من التعلم إلى المعروف

source: Mixed Directions
ar: اتجاهات مختلطة

source: Language to Learn
ar: اللغة للتعلم

source: Known Language
ar: اللغة المعروفة

source: Practice Mode
ar: وضع التدريب

source: Flash Cards
ar: بطاقات تذكر

source: Mixed &Letters
ar: أ&حرف مختلطة

source: M&ultiple Choice
ar: ا&ختيار من متعدد

source: Wri&tten
ar: ك&تابي

source: E&xample Sentences
ar: &جملة مثال

source: &Gender of Nouns
ar: &جنس الأسماء

source: Co&njugations
ar: ت&صريفات

source: Practice Direction
ar: اتجاه التدريب

source: Remember for each Practice Mode
ar: تذكر لكل وضع تدريب

# Confidence level in language, table header
source: Confidence (%1)
ar: الثقة (%1)
